MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX470F512L.atdf
         <register caption="DMA Channel x Event Control Register" name="DCH1ECON" offset="0x130" rw="RW" size="4">
            <bitfield caption="Channel Abort IRQ Enable bit" mask="0x00000008" name="AIRQEN" values="DCH1ECON__AIRQEN" />
            <bitfield caption="Channel Start IRQ Enable bit" mask="0x00000010" name="SIRQEN" values="DCH1ECON__SIRQEN" />
            <bitfield caption="Channel Pattern Match Abort Enable bit" mask="0x00000020" name="PATEN" values="DCH1ECON__PATEN" />
            <bitfield caption="DMA Abort Transfer bit" mask="0x00000040" name="CABORT" values="DCH1ECON__CABORT" />
            <bitfield caption="DMA Forced Transfer bit" mask="0x00000080" name="CFORCE" values="DCH1ECON__CFORCE" />
            <bitfield caption="Channel Transfer Start IRQ bits" mask="0x0000FF00" name="CHSIRQ" values="DCH1ECON__CHSIRQ" />
            <bitfield caption="Channel Transfer Abort IRQ bits" mask="0x00FF0000" name="CHAIRQ" values="DCH1ECON__CHAIRQ" />
         </register>
         <register caption="DMA Channel x Event Control Register" name="DCH2ECON" offset="0x1f0" rw="RW" size="4">
            <bitfield caption="Channel Abort IRQ Enable bit" mask="0x00000008" name="AIRQEN" values="DCH2ECON__AIRQEN" />
            <bitfield caption="Channel Start IRQ Enable bit" mask="0x00000010" name="SIRQEN" values="DCH2ECON__SIRQEN" />
            <bitfield caption="Channel Pattern Match Abort Enable bit" mask="0x00000020" name="PATEN" values="DCH2ECON__PATEN" />
            <bitfield caption="DMA Abort Transfer bit" mask="0x00000040" name="CABORT" values="DCH2ECON__CABORT" />
            <bitfield caption="DMA Forced Transfer bit" mask="0x00000080" name="CFORCE" values="DCH2ECON__CFORCE" />
            <bitfield caption="Channel Transfer Start IRQ bits" mask="0x0000FF00" name="CHSIRQ" values="DCH2ECON__CHSIRQ" />
            <bitfield caption="Channel Transfer Abort IRQ bits" mask="0x00FF0000" name="CHAIRQ" values="DCH2ECON__CHAIRQ" />
         </register>
         <register caption="DMA Channel x Event Control Register" name="DCH3ECON" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="Channel Abort IRQ Enable bit" mask="0x00000008" name="AIRQEN" values="DCH3ECON__AIRQEN" />
            <bitfield caption="Channel Start IRQ Enable bit" mask="0x00000010" name="SIRQEN" values="DCH3ECON__SIRQEN" />
            <bitfield caption="Channel Pattern Match Abort Enable bit" mask="0x00000020" name="PATEN" values="DCH3ECON__PATEN" />
            <bitfield caption="DMA Abort Transfer bit" mask="0x00000040" name="CABORT" values="DCH3ECON__CABORT" />
            <bitfield caption="DMA Forced Transfer bit" mask="0x00000080" name="CFORCE" values="DCH3ECON__CFORCE" />
            <bitfield caption="Channel Transfer Start IRQ bits" mask="0x0000FF00" name="CHSIRQ" values="DCH3ECON__CHSIRQ" />
            <bitfield caption="Channel Transfer Abort IRQ bits" mask="0x00FF0000" name="CHAIRQ" values="DCH3ECON__CHAIRQ" />
         </register>
         <register caption="DMA Channel x Interrupt Control Register" name="DCH0INT" offset="0x80" rw="RW" size="4">
            <bitfield caption="Channel Address Error Interrupt Flag bit" mask="0x00000001" name="CHERIF" values="DCH0INT__CHERIF" />
            <bitfield caption="Channel Transfer Abort Interrupt Flag bit" mask="0x00000002" name="CHTAIF" values="DCH0INT__CHTAIF" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Flag bit" mask="0x00000004" name="CHCCIF" values="DCH0INT__CHCCIF" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Flag bit" mask="0x00000008" name="CHBCIF" values="DCH0INT__CHBCIF" />
            <bitfield caption="Channel Destination Half Full Interrupt Flag bit" mask="0x00000010" name="CHDHIF" values="DCH0INT__CHDHIF" />
            <bitfield caption="Channel Destination Done Interrupt Flag bit" mask="0x00000020" name="CHDDIF" values="DCH0INT__CHDDIF" />
            <bitfield caption="Channel Source Half Empty Interrupt Flag bit" mask="0x00000040" name="CHSHIF" values="DCH0INT__CHSHIF" />
            <bitfield caption="Channel Source Done Interrupt Flag bit" mask="0x00000080" name="CHSDIF" values="DCH0INT__CHSDIF" />
            <bitfield caption="Channel Address Error Interrupt Enable bit" mask="0x00010000" name="CHERIE" values="DCH0INT__CHERIE" />
            <bitfield caption="Channel Transfer Abort Interrupt Enable bit" mask="0x00020000" name="CHTAIE" values="DCH0INT__CHTAIE" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Enable bit" mask="0x00040000" name="CHCCIE" values="DCH0INT__CHCCIE" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Enable bit" mask="0x00080000" name="CHBCIE" values="DCH0INT__CHBCIE" />
            <bitfield caption="Channel Destination Half Full Interrupt Enable bit" mask="0x00100000" name="CHDHIE" values="DCH0INT__CHDHIE" />
            <bitfield caption="Channel Destination Done Interrupt Enable bit" mask="0x00200000" name="CHDDIE" values="DCH0INT__CHDDIE" />
            <bitfield caption="Channel Source Half Empty Interrupt Enable bit" mask="0x00400000" name="CHSHIE" values="DCH0INT__CHSHIE" />
            <bitfield caption="Channel Source Done Interrupt Enable bit" mask="0x00800000" name="CHSDIE" values="DCH0INT__CHSDIE" />
         </register>
         <register caption="DMA Channel x Interrupt Control Register" name="DCH1INT" offset="0x140" rw="RW" size="4">
            <bitfield caption="Channel Address Error Interrupt Flag bit" mask="0x00000001" name="CHERIF" values="DCH1INT__CHERIF" />
            <bitfield caption="Channel Transfer Abort Interrupt Flag bit" mask="0x00000002" name="CHTAIF" values="DCH1INT__CHTAIF" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Flag bit" mask="0x00000004" name="CHCCIF" values="DCH1INT__CHCCIF" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Flag bit" mask="0x00000008" name="CHBCIF" values="DCH1INT__CHBCIF" />
            <bitfield caption="Channel Destination Half Full Interrupt Flag bit" mask="0x00000010" name="CHDHIF" values="DCH1INT__CHDHIF" />
            <bitfield caption="Channel Destination Done Interrupt Flag bit" mask="0x00000020" name="CHDDIF" values="DCH1INT__CHDDIF" />
            <bitfield caption="Channel Source Half Empty Interrupt Flag bit" mask="0x00000040" name="CHSHIF" values="DCH1INT__CHSHIF" />
            <bitfield caption="Channel Source Done Interrupt Flag bit" mask="0x00000080" name="CHSDIF" values="DCH1INT__CHSDIF" />
            <bitfield caption="Channel Address Error Interrupt Enable bit" mask="0x00010000" name="CHERIE" values="DCH1INT__CHERIE" />
            <bitfield caption="Channel Transfer Abort Interrupt Enable bit" mask="0x00020000" name="CHTAIE" values="DCH1INT__CHTAIE" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Enable bit" mask="0x00040000" name="CHCCIE" values="DCH1INT__CHCCIE" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Enable bit" mask="0x00080000" name="CHBCIE" values="DCH1INT__CHBCIE" />
            <bitfield caption="Channel Destination Half Full Interrupt Enable bit" mask="0x00100000" name="CHDHIE" values="DCH1INT__CHDHIE" />
            <bitfield caption="Channel Destination Done Interrupt Enable bit" mask="0x00200000" name="CHDDIE" values="DCH1INT__CHDDIE" />
            <bitfield caption="Channel Source Half Empty Interrupt Enable bit" mask="0x00400000" name="CHSHIE" values="DCH1INT__CHSHIE" />
            <bitfield caption="Channel Source Done Interrupt Enable bit" mask="0x00800000" name="CHSDIE" values="DCH1INT__CHSDIE" />
         </register>
         <register caption="DMA Channel x Interrupt Control Register" name="DCH2INT" offset="0x200" rw="RW" size="4">
            <bitfield caption="Channel Address Error Interrupt Flag bit" mask="0x00000001" name="CHERIF" values="DCH2INT__CHERIF" />
            <bitfield caption="Channel Transfer Abort Interrupt Flag bit" mask="0x00000002" name="CHTAIF" values="DCH2INT__CHTAIF" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Flag bit" mask="0x00000004" name="CHCCIF" values="DCH2INT__CHCCIF" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Flag bit" mask="0x00000008" name="CHBCIF" values="DCH2INT__CHBCIF" />
            <bitfield caption="Channel Destination Half Full Interrupt Flag bit" mask="0x00000010" name="CHDHIF" values="DCH2INT__CHDHIF" />
            <bitfield caption="Channel Destination Done Interrupt Flag bit" mask="0x00000020" name="CHDDIF" values="DCH2INT__CHDDIF" />
            <bitfield caption="Channel Source Half Empty Interrupt Flag bit" mask="0x00000040" name="CHSHIF" values="DCH2INT__CHSHIF" />
            <bitfield caption="Channel Source Done Interrupt Flag bit" mask="0x00000080" name="CHSDIF" values="DCH2INT__CHSDIF" />
            <bitfield caption="Channel Address Error Interrupt Enable bit" mask="0x00010000" name="CHERIE" values="DCH2INT__CHERIE" />
            <bitfield caption="Channel Transfer Abort Interrupt Enable bit" mask="0x00020000" name="CHTAIE" values="DCH2INT__CHTAIE" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Enable bit" mask="0x00040000" name="CHCCIE" values="DCH2INT__CHCCIE" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Enable bit" mask="0x00080000" name="CHBCIE" values="DCH2INT__CHBCIE" />
            <bitfield caption="Channel Destination Half Full Interrupt Enable bit" mask="0x00100000" name="CHDHIE" values="DCH2INT__CHDHIE" />
            <bitfield caption="Channel Destination Done Interrupt Enable bit" mask="0x00200000" name="CHDDIE" values="DCH2INT__CHDDIE" />
            <bitfield caption="Channel Source Half Empty Interrupt Enable bit" mask="0x00400000" name="CHSHIE" values="DCH2INT__CHSHIE" />
            <bitfield caption="Channel Source Done Interrupt Enable bit" mask="0x00800000" name="CHSDIE" values="DCH2INT__CHSDIE" />
         </register>
         <register caption="DMA Channel x Interrupt Control Register" name="DCH3INT" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="Channel Address Error Interrupt Flag bit" mask="0x00000001" name="CHERIF" values="DCH3INT__CHERIF" />
            <bitfield caption="Channel Transfer Abort Interrupt Flag bit" mask="0x00000002" name="CHTAIF" values="DCH3INT__CHTAIF" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Flag bit" mask="0x00000004" name="CHCCIF" values="DCH3INT__CHCCIF" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Flag bit" mask="0x00000008" name="CHBCIF" values="DCH3INT__CHBCIF" />
            <bitfield caption="Channel Destination Half Full Interrupt Flag bit" mask="0x00000010" name="CHDHIF" values="DCH3INT__CHDHIF" />
            <bitfield caption="Channel Destination Done Interrupt Flag bit" mask="0x00000020" name="CHDDIF" values="DCH3INT__CHDDIF" />
            <bitfield caption="Channel Source Half Empty Interrupt Flag bit" mask="0x00000040" name="CHSHIF" values="DCH3INT__CHSHIF" />
            <bitfield caption="Channel Source Done Interrupt Flag bit" mask="0x00000080" name="CHSDIF" values="DCH3INT__CHSDIF" />
            <bitfield caption="Channel Address Error Interrupt Enable bit" mask="0x00010000" name="CHERIE" values="DCH3INT__CHERIE" />
            <bitfield caption="Channel Transfer Abort Interrupt Enable bit" mask="0x00020000" name="CHTAIE" values="DCH3INT__CHTAIE" />
            <bitfield caption="Channel Cell Transfer Complete Interrupt Enable bit" mask="0x00040000" name="CHCCIE" values="DCH3INT__CHCCIE" />
            <bitfield caption="Channel Block Transfer Complete Interrupt Enable bit" mask="0x00080000" name="CHBCIE" values="DCH3INT__CHBCIE" />
            <bitfield caption="Channel Destination Half Full Interrupt Enable bit" mask="0x00100000" name="CHDHIE" values="DCH3INT__CHDHIE" />
            <bitfield caption="Channel Destination Done Interrupt Enable bit" mask="0x00200000" name="CHDDIE" values="DCH3INT__CHDDIE" />
            <bitfield caption="Channel Source Half Empty Interrupt Enable bit" mask="0x00400000" name="CHSHIE" values="DCH3INT__CHSHIE" />
            <bitfield caption="Channel Source Done Interrupt Enable bit" mask="0x00800000" name="CHSDIE" values="DCH3INT__CHSDIE" />
         </register>
         <register caption="DMA Channel x Source Start Address Register" name="DCH0SSA" offset="0x90" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DCH0SSA" />
         </register>
         <register caption="DMA Channel x Source Start Address Register" name="DCH1SSA" offset="0x150" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DCH1SSA" />
         </register>
         <register caption="DMA Channel x Source Start Address Register" name="DCH2SSA" offset="0x210" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DCH2SSA" />
         </register>
         <register caption="DMA Channel x Source Start Address Register" name="DCH3SSA" offset="0x2d0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DCH3SSA" />
         </register>
         <register caption="DMA Channel x Destination Start Address Register" name="DCH0DSA" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DCH0DSA" />
         </register>
         <register caption="DMA Channel x Destination Start Address Register" name="DCH1DSA" offset="0x160" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DCH1DSA" />
         </register>
         <register caption="DMA Channel x Destination Start Address Register" name="DCH2DSA" offset="0x220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DCH2DSA" />
         </register>
         <register caption="DMA Channel x Destination Start Address Register" name="DCH3DSA" offset="0x2e0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DCH3DSA" />
         </register>
         <register caption="DMA Channel x Source Size Register" name="DCH0SSIZ" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Channel Source Size bits" mask="0x0000FFFF" name="CHSSIZ" values="DCH0SSIZ__CHSSIZ" />
         </register>
         <register caption="DMA Channel x Source Size Register" name="DCH1SSIZ" offset="0x170" rw="RW" size="4">
            <bitfield caption="Channel Source Size bits" mask="0x0000FFFF" name="CHSSIZ" values="DCH1SSIZ__CHSSIZ" />
         </register>
         <register caption="DMA Channel x Source Size Register" name="DCH2SSIZ" offset="0x230" rw="RW" size="4">
            <bitfield caption="Channel Source Size bits" mask="0x0000FFFF" name="CHSSIZ" values="DCH2SSIZ__CHSSIZ" />
         </register>
