MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX470F512L.atdf
      <value-group caption="Timer On bit" name="T5CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Module is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01618" name="TRAA_Ports" version="">
      <register-group name="TRAA_Ports">
         <register caption="Peripheral Pin Select Output Register" name="INT1R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT1R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="INT2R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT2R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="INT3R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT3R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="INT4R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT4R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="T2CKR" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T2CKR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="T3CKR" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T3CKR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="T4CKR" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T4CKR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="T5CKR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T5CKR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="IC1R" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC1R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="IC2R" offset="0x28" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC2R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="IC3R" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC3R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="IC4R" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC4R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="IC5R" offset="0x34" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC5R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="OCFAR" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="OCFAR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="U1RXR" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U1RXR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="U1CTSR" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U1CTSR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="U2RXR" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U2RXR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="U2CTSR" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U2CTSR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="U3RXR" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U3RXR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="U3CTSR" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U3CTSR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="U4RXR" offset="0x64" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U4RXR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="U4CTSR" offset="0x68" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U4CTSR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="U5RXR" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U5RXR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="U5CTSR" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U5CTSR" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="SDI1R" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI1R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="SS1R" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS1R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="SDI2R" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI2R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="SS2R" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS2R" />
         </register>
         <register caption="Peripheral Pin Select Output Register" name="REFCLKIR" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFCLKIR" />
         </register>
      </register-group>
   </module>
   <module caption="" id="00734" name="UART" version="1">
      <register-group name="UART">
         <register caption="UARTx Mode Register" name="U1MODE" offset="0x0" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U1MODE__STSEL" />
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U1MODE__PDSEL" />
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U1MODE__BRGH" />
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U1MODE__RXINV" />
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U1MODE__ABAUD" />
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U1MODE__LPBACK" />
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U1MODE__WAKE" />
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U1MODE__UEN" />
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U1MODE__RTSMD" />
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U1MODE__IREN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U1MODE__SIDL" />
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U1MODE__ON" />
         </register>
         <register caption="UARTx Mode Register" name="U2MODE" offset="0x200" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U2MODE__STSEL" />
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U2MODE__PDSEL" />
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U2MODE__BRGH" />
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U2MODE__RXINV" />
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U2MODE__ABAUD" />
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U2MODE__LPBACK" />
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U2MODE__WAKE" />
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U2MODE__UEN" />
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U2MODE__RTSMD" />
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U2MODE__IREN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U2MODE__SIDL" />
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U2MODE__ON" />
         </register>
         <register caption="UARTx Mode Register" name="U3MODE" offset="0x400" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U3MODE__STSEL" />
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U3MODE__PDSEL" />
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U3MODE__BRGH" />
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U3MODE__RXINV" />
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U3MODE__ABAUD" />
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U3MODE__LPBACK" />
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U3MODE__WAKE" />
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U3MODE__UEN" />
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U3MODE__RTSMD" />
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U3MODE__IREN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U3MODE__SIDL" />
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U3MODE__ON" />
         </register>
         <register caption="UARTx Mode Register" name="U4MODE" offset="0x600" rw="RW" size="4">
            <bitfield caption="Stop Selection bit" mask="0x00000001" name="STSEL" values="U4MODE__STSEL" />
            <bitfield caption="Parity and Data Selection bits" mask="0x00000006" name="PDSEL" values="U4MODE__PDSEL" />
            <bitfield caption="High Baud Rate Enable bit" mask="0x00000008" name="BRGH" values="U4MODE__BRGH" />
            <bitfield caption="Receive Polarity Inversion bit" mask="0x00000010" name="RXINV" values="U4MODE__RXINV" />
            <bitfield caption="Auto-Baud Enable bit" mask="0x00000020" name="ABAUD" values="U4MODE__ABAUD" />
            <bitfield caption="UARTx Loopback Mode Select bit" mask="0x00000040" name="LPBACK" values="U4MODE__LPBACK" />
            <bitfield caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" mask="0x00000080" name="WAKE" values="U4MODE__WAKE" />
            <bitfield caption="UARTx Enable bits" mask="0x00000300" name="UEN" values="U4MODE__UEN" />
            <bitfield caption="Mode Selection for UxRTS Pin bit" mask="0x00000800" name="RTSMD" values="U4MODE__RTSMD" />
            <bitfield caption="IrDA Encoder and Decoder Enable bit" mask="0x00001000" name="IREN" values="U4MODE__IREN" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="U4MODE__SIDL" />
            <bitfield caption="UARTx Enable bit" mask="0x00008000" name="ON" values="U4MODE__ON" />
         </register>
