MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX470F512L.atdf
      <value-group caption="Endpoint Receive Enable bit" name="U1EP1__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP1__EPCONDIS">
         <value caption="Disable Endpoint n from Control transfers; only TX and RX transfers allowed" name="" value="0x1" />
         <value caption="Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP2__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP2__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP2__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP2__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP2__EPCONDIS">
         <value caption="Disable Endpoint n from Control transfers; only TX and RX transfers allowed" name="" value="0x1" />
         <value caption="Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP3__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP3__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP3__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP3__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP3__EPCONDIS">
         <value caption="Disable Endpoint n from Control transfers; only TX and RX transfers allowed" name="" value="0x1" />
         <value caption="Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP4__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP4__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP4__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP4__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP4__EPCONDIS">
         <value caption="Disable Endpoint n from Control transfers; only TX and RX transfers allowed" name="" value="0x1" />
         <value caption="Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP5__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP5__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP5__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP5__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP5__EPCONDIS">
         <value caption="Disable Endpoint n from Control transfers; only TX and RX transfers allowed" name="" value="0x1" />
         <value caption="Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP6__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP6__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP6__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP6__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
